GopalSaraf/Practicals/PSDL/include/proc/pic12f609.inc
/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 07FFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 07Fh)
#endif
#define ANS0                             BANKMASK(ANSEL), 0
#define ANS1                             BANKMASK(ANSEL), 1
#define ANS3                             BANKMASK(ANSEL), 3
#define C1CH                             BANKMASK(CMCON0), 0
#define C1CH0                            BANKMASK(CMCON0), 0
#define C1HYS                            BANKMASK(CMCON1), 3
#define C1IE                             BANKMASK(PIE1), 3
#define C1IF                             BANKMASK(PIR1), 3
#define C1OE                             BANKMASK(CMCON0), 5
#define C1ON                             BANKMASK(CMCON0), 7
#define C1OUT                            BANKMASK(CMCON0), 6
#define C1POL                            BANKMASK(CMCON0), 4
#define C1R                              BANKMASK(CMCON0), 2
#define C1SYNC                           BANKMASK(CMCON1), 0
#define C1VREN                           BANKMASK(VRCON), 7
#define CARRY                            BANKMASK(STATUS), 0
#define CMCH                             BANKMASK(CMCON0), 0
#define CMHYS                            BANKMASK(CMCON1), 3
#define CMIE                             BANKMASK(PIE1), 3
#define CMIF                             BANKMASK(PIR1), 3
#define CMOE                             BANKMASK(CMCON0), 5
#define CMON                             BANKMASK(CMCON0), 7
#define CMPOL                            BANKMASK(CMCON0), 4
#define CMR                              BANKMASK(CMCON0), 2
#define CMSYNC                           BANKMASK(CMCON1), 0
#define CMVREN                           BANKMASK(VRCON), 7
#define COUT                             BANKMASK(CMCON0), 6
#define DC                               BANKMASK(STATUS), 1
#define FBREN                            BANKMASK(VRCON), 4
#define FVREN                            BANKMASK(VRCON), 4
#define GIE                              BANKMASK(INTCON), 7
#define GP0                              BANKMASK(GPIO), 0
#define GP1                              BANKMASK(GPIO), 1
#define GP2                              BANKMASK(GPIO), 2
#define GP3                              BANKMASK(GPIO), 3
#define GP4                              BANKMASK(GPIO), 4
#define GP5                              BANKMASK(GPIO), 5
#define GPIE                             BANKMASK(INTCON), 3
#define GPIF                             BANKMASK(INTCON), 0
#define GPIO0                            BANKMASK(GPIO), 0
#define GPIO1                            BANKMASK(GPIO), 1
#define GPIO2                            BANKMASK(GPIO), 2
#define GPIO3                            BANKMASK(GPIO), 3
#define GPIO4                            BANKMASK(GPIO), 4
#define GPIO5                            BANKMASK(GPIO), 5
#define INTE                             BANKMASK(INTCON), 4
#define INTEDG                           BANKMASK(OPTION_REG), 6
#define INTF                             BANKMASK(INTCON), 1
#define IOC0                             BANKMASK(IOC), 0
#define IOC1                             BANKMASK(IOC), 1
#define IOC2                             BANKMASK(IOC), 2
#define IOC3                             BANKMASK(IOC), 3
#define IOC4                             BANKMASK(IOC), 4
#define IOC5                             BANKMASK(IOC), 5
#define IOCA0                            BANKMASK(IOC), 0
#define IOCA1                            BANKMASK(IOC), 1
#define IOCA2                            BANKMASK(IOC), 2
#define IOCA3                            BANKMASK(IOC), 3
#define IOCA4                            BANKMASK(IOC), 4
#define IOCA5                            BANKMASK(IOC), 5
#define PEIE                             BANKMASK(INTCON), 6
#define PS0                              BANKMASK(OPTION_REG), 0
#define PS1                              BANKMASK(OPTION_REG), 1
#define PS2                              BANKMASK(OPTION_REG), 2
#define PSA                              BANKMASK(OPTION_REG), 3
#define RA0                              BANKMASK(GPIO), 0
#define RA1                              BANKMASK(GPIO), 1
#define RA2                              BANKMASK(GPIO), 2
#define RA3                              BANKMASK(GPIO), 3
#define RA4                              BANKMASK(GPIO), 4
#define RA5                              BANKMASK(GPIO), 5
#define RP0                              BANKMASK(STATUS), 5
#define RP1                              BANKMASK(STATUS), 6
#define T0CS                             BANKMASK(OPTION_REG), 5
#define T0IE                             BANKMASK(INTCON), 5
#define T0IF                             BANKMASK(INTCON), 2
#define T0SE                             BANKMASK(OPTION_REG), 4
#define T1ACS                            BANKMASK(CMCON1), 4
#define T1CKPS0                          BANKMASK(T1CON), 4
#define T1CKPS1                          BANKMASK(T1CON), 5
#define T1GINV                           BANKMASK(T1CON), 7
#define T1GSS                            BANKMASK(CMCON1), 1
#define T1IE                             BANKMASK(PIE1), 0
#define T1IF                             BANKMASK(PIR1), 0
#define T1OSCEN                          BANKMASK(T1CON), 3
#define TMR0IE                           BANKMASK(INTCON), 5
#define TMR0IF                           BANKMASK(INTCON), 2
#define TMR1CS                           BANKMASK(T1CON), 1
#define TMR1GE                           BANKMASK(T1CON), 6
#define TMR1IE                           BANKMASK(PIE1), 0
#define TMR1IF                           BANKMASK(PIR1), 0
#define TMR1ON                           BANKMASK(T1CON), 0
#define TRISA0                           BANKMASK(TRISIO), 0
#define TRISA1                           BANKMASK(TRISIO), 1
#define TRISA2                           BANKMASK(TRISIO), 2
#define TRISA3                           BANKMASK(TRISIO), 3
#define TRISA4                           BANKMASK(TRISIO), 4
#define TRISA5                           BANKMASK(TRISIO), 5
#define TRISIO0                          BANKMASK(TRISIO), 0
#define TRISIO1                          BANKMASK(TRISIO), 1
#define TRISIO2                          BANKMASK(TRISIO), 2
#define TRISIO3                          BANKMASK(TRISIO), 3
#define TRISIO4                          BANKMASK(TRISIO), 4
#define TRISIO5                          BANKMASK(TRISIO), 5
#define TUN0                             BANKMASK(OSCTUNE), 0
#define TUN1                             BANKMASK(OSCTUNE), 1
#define TUN2                             BANKMASK(OSCTUNE), 2
#define TUN3                             BANKMASK(OSCTUNE), 3
#define TUN4                             BANKMASK(OSCTUNE), 4
#define VP6EN                            BANKMASK(VRCON), 4
#define VR0                              BANKMASK(VRCON), 0
#define VR1                              BANKMASK(VRCON), 1
#define VR2                              BANKMASK(VRCON), 2
#define VR3                              BANKMASK(VRCON), 3
#define VRR                              BANKMASK(VRCON), 5
#define WPU0                             BANKMASK(WPU), 0
#define WPU1                             BANKMASK(WPU), 1
#define WPU2                             BANKMASK(WPU), 2
#define WPU4                             BANKMASK(WPU), 4
#define WPU5                             BANKMASK(WPU), 5
#define WPUA0                            BANKMASK(WPU), 0
#define WPUA1                            BANKMASK(WPU), 1
#define WPUA2                            BANKMASK(WPU), 2
#define WPUA4                            BANKMASK(WPU), 4
#define WPUA5                            BANKMASK(WPU), 5
#define ZERO                             BANKMASK(STATUS), 2
#define nBOD                             BANKMASK(PCON), 0
#define nBOR                             BANKMASK(PCON), 0
#define nGPPU                            BANKMASK(OPTION_REG), 7
#define nPD                              BANKMASK(STATUS), 3
#define nPOR                             BANKMASK(PCON), 1
#define nT1SYNC                          BANKMASK(T1CON), 2
#define nTO                              BANKMASK(STATUS), 4

/*
 * Device Psects
 */

#ifdef _XC_INC_

// Memory Spaces
#define SPACE_CODE   0
#define SPACE_DATA   1
#define SPACE_EEPROM 3

psect udata_shr,class=COMMON,space=SPACE_DATA,noexec
psect udata,class=RAM,space=SPACE_DATA,noexec
psect udata_bank0,class=BANK0,space=SPACE_DATA,noexec
psect code,class=CODE,space=SPACE_CODE,delta=2
psect data,class=STRCODE,space=SPACE_CODE,delta=2,noexec

#endif // _XC_INC_

#endif // _PIC12F609_INC_
